#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyz         1     NONE   float   xyz 
;
; shader debug name: f0896a92b3f1d2b1eb7599907a1a1893.pdb
; shader hash: f0896a92b3f1d2b1eb7599907a1a1893
;
; Pipeline Runtime Information: 
;
;
;
; Vertex Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer ModelViewProjectionConstantBuffer
; {
;
;   struct dx.alignment.legacy.ModelViewProjectionConstantBuffer
;   {
;
;       column_major float4x4 model;                  ; Offset:    0
;       column_major float4x4 view;                   ; Offset:   64
;       column_major float4x4 projection;             ; Offset:  128
;   
;   } ModelViewProjectionConstantBuffer;              ; Offset:    0 Size:   192
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !49)
!1 = !DIFile(filename: "MeshShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !{!25}
!25 = !DISubprogram(name: "MSMain", scope: !1, file: !1, line: 18, type: !26, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @MSMain)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28, !28, !37, !45}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !30, templateParams: !35)
!30 = !{!31, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!36, !23}
!36 = !DITemplateTypeParameter(name: "element", type: !32)
!37 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1792, align: 32, elements: !43)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "MSvert", file: !1, line: 10, size: 224, align: 32, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !39, file: !1, line: 12, baseType: !4, size: 128, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !39, file: !1, line: 13, baseType: !16, size: 96, align: 32, offset: 128)
!43 = !{!44}
!44 = !DISubrange(count: 8)
!45 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1152, align: 32, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 12)
!49 = !{!50, !53}
!50 = !DIGlobalVariable(name: "numVertices", scope: !25, file: !1, line: 26, type: !51, isLocal: true, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !32)
!53 = !DIGlobalVariable(name: "numPrimitives", scope: !25, file: !1, line: 27, type: !51, isLocal: true, isDefinition: true)
!54 = !{i32 2, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
